Revit 2024 API
ScheduleFilter Constructor
Overload List
Name | Description
ScheduleFilter()
 Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType)
 Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType, ElementId)
 Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType, Double)
 Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType, Int32)
 Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType, String)
 Creates a new ScheduleFilter.
See Also
ScheduleFilter Class
ScheduleFilter Members
Autodesk.Revit.DB Namespace